# Общие переменные, касающиеся бота

orel_or_reshka = ['Орел', 'Решка']

hi_words = ["You are welcome!", "Hi, my friend!", "Здарова", "Привет", "Здравствуй", "hi", "ку-ку", "Здравия желаю", "ну привет",
            "о, я так тебя ждал!", "вечер в хату", "Добро пожаловать", "Салют!", "Хэллоу!", "Приветик", "угу", "хай", "доброго времени суток"]

gb_words = ["Пока", "Прощай", "Гудбай", "Досвидос", "До свидания", "Всего доброго", "Приятно было пообщаться. Возвращайся", 
            "До скорых встреч", "пока-пока", "бай-бай"]