public class volna {
 
    public static void main(String[] args) {
     
     
    int i = 0;
    int j = 0;
    int z = 0;
    int k = 0;
     
    //Счетчик волн
    int Ni = 0;
    //Примерное количество ходов для поиска
    // int Nk = 256;
    //Размер массива
    int n = 10;

     
    int lab[][] = { {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
    {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
    {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
    {254, 254, 254, 255, 255, 254, 254, 254, 254, 254},
    {254, 254, 253, 255, 254, 254, 254, 254, 254, 254},
    {254, 254, 254, 255, 254, 0, 254, 254, 254, 254},
    {254, 254, 254, 255, 254, 254, 254, 254, 254, 254},
    {254, 254, 254, 255, 255, 254, 254, 254, 254, 254},
    {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
    {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
    {254, 254, 254, 254, 254, 254, 254, 254, 254, 254}};
     
    //Нужно три цикла. С двумя работать не будет.
    //Первый цикл можно делать по размеру массива - будет работать.
     
    label : for (int l = 0; l < 256; l++){
    for (i = 0; i < n; i++){ 
    for (j = 0; j < n; j++){
     
    //Условия, чтоб не заскочить за край цикла
    if (lab[i][j] == Ni && i > 0 && i < n && j > 0 && j < n-1){
     
    //Четыре условия для поиска нужного значения вокруг точки
    //и для перехода на следующий гребень волны.
    if(lab[i][j+1] == 254){
    lab[i][j+1] = Ni+1;
    }
    if(lab[i][j+1]== 253){
    z = i;
    k = j+1;
    break label;
    }
     
    if(lab[i+1][j] == 254){
    lab[i+1][j] = Ni+1;
    }
    if(lab[i+1][j]== 253){
    z = i+1;
    k = j;
    break label; 
     
    }
     
    if(lab[i][j-1] == 254){
    lab[i][j-1] = Ni+1;
    }
    if(lab[i][j-1] == 253){
    z = i;
    k = j-1;
    break label; 
     
    }
    if(lab[i-1][j] == 254){
    lab[i-1][j] = Ni+1;
    }
    if(lab[i-1][j] == 253){
    z = i-1;
    k = j;
    //Метку я сделал, чтоб волны остановились на нужном значении
    break label;
     
    } 
     
     
    }
     
    }
    }
    //
    Ni++;
    } 
     
    //Вывод волны
    for (i = 0; i < n; i++){
    for (j = 0; j < n; j++){
    System.out.printf("%4d", lab[i][j]);
    }
    System.out.println();
    }
     
    }
     
    }