# Найти сумму чисел списка стоящих на нечетной позиции

list = [1, 2, 3, 4, 5, 2, 9, 3, 1, 5]

new_list = sum(list[1::2])
print(new_list)